//Функция ОпределитьТекущегоПользователя() экспорт

//	Если ПустаяСтрока(ИмяПользователя()) Тогда
//		ИмяПользователя           = "НеАвторизован";
//		ПолноеИмяПользователя     = "Не авторизован";        
//	Иначе
//		ИмяПользователя           = ИмяПользователя();
//		
//		Если ПустаяСтрока(ПолноеИмяПользователя()) Тогда
//			ПолноеИмяПользователя = ИмяПользователя;
//		Иначе
//			ПолноеИмяПользователя = ПолноеИмяПользователя();
//		КонецЕсли;
//	КонецЕсли; 
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	Пользователи.Ссылка КАК Ссылка
//	               |ИЗ
//	               |	Справочник.Пользователи КАК Пользователи
//	               |ГДЕ
//	               |	Пользователи.Идентификатор = &Идентификатор";
//	
//	Запрос.УстановитьПараметр("Идентификатор", ИмяПользователя);
//	Результат = Запрос.Выполнить();
//	
//	Если Результат.Пустой() Тогда
//		
//		ОбъектПользователь = Справочники.Пользователи.СоздатьЭлемент();
//		ОбъектПользователь.Наименование = ПолноеИмяПользователя;
//		ОбъектПользователь.Идентификатор = ИмяПользователя;
//		
//    	Попытка
//			ОбъектПользователь.Записать();
//        Исключение
//			ВызватьИсключение "Пользователь : " + ИмяПользователя + " не был найден в справочнике пользователей. Возникла ошибка при добавлении пользователя в справочник.
//				|" + ОписаниеОшибки();
//        
//			Возврат Справочники.Пользователи.ПустаяСсылка();
//			
//		КонецПопытки;
//        
//		ТекущийПользователь = ОбъектПользователь.Ссылка;

//    Иначе
//		Выборка = Результат.Выбрать();
//		Выборка.Следующий();
//		ТекущийПользователь = Выборка.Ссылка;	
//		
//	КонецЕсли; 
//       
//    Возврат ТекущийПользователь;

//КонецФункции 