&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если РольДоступна("Администратор")Тогда
		Элементы.ДатаФактическогоВыполнения.ТолькоПросмотр = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыполненаПриИзмененииНаСервере()
	
	Если Объект.Выполнена Тогда
		Объект.ДатаФактическогоВыполнения = ТекущаяДата();
		Объект.ФактическийПользователь =  ПараметрыСеанса.ТекущийПользователь;
	Иначе
		Объект.ДатаФактическогоВыполнения = Дата("00010101"); 
		Объект.ФактическийПользователь = Справочники.Пользователи.ПустаяСсылка();	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполненаПриИзменении(Элемент)
	ВыполненаПриИзмененииНаСервере();
КонецПроцедуры
