&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если РольДоступна("Администратор")Тогда
		Элементы.ДатаФактическогоВыполнения.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачаПользователя.Ссылка КАК Ссылка
		|ИЗ
		|	Задача.ЗадачаПользователя КАК ЗадачаПользователя
		|ГДЕ
		|	ЗадачаПользователя.БизнесПроцесс = &БизнесПроцесс
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗадачаПользователя.Дата";
	
	Запрос.УстановитьПараметр("БизнесПроцесс", Объект.БизнесПроцесс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = Объект.ИсторияЗадач.Добавить();
		НоваяСтрока.Задача = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура ВыполненаПриИзмененииНаСервере()
	
	Если Объект.Выполнена Тогда
		Объект.ДатаФактическогоВыполнения = ТекущаяДата();
		Объект.ФактическийПользователь =  ПараметрыСеанса.ТекущийПользователь;
	Иначе
		Объект.ДатаФактическогоВыполнения = Дата("00010101"); 
		Объект.ФактическийПользователь = Справочники.Пользователи.ПустаяСсылка();	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполненаПриИзменении(Элемент)
	ВыполненаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ПустаяСсылка()
	Возврат БизнесПроцессы.Исполнение.ПустаяСсылка(); 
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если (Объект.БизнесПроцесс <> ПустаяСсылка() И Объект.Наименование = "Проверка") = Истина Тогда 
		Ответ = Вопрос( "Задача выполнена успешно?", РежимДиалогаВопрос.ДаНет,0);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.Результат = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
