&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если РольДоступна("Администратор")Тогда
		Элементы.ДатаФактическогоВыполнения.ТолькоПросмотр = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыполненаПриИзмененииНаСервере()
	
	Если Объект.Выполнена Тогда
		Объект.ДатаФактическогоВыполнения = ТекущаяДата();
		Объект.ФактическийПользователь =  ПараметрыСеанса.ТекущийПользователь;
	Иначе
		Объект.ДатаФактическогоВыполнения = Дата("00010101"); 
		Объект.ФактическийПользователь = Справочники.Пользователи.ПустаяСсылка();	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполненаПриИзменении(Элемент)
	ВыполненаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция ПустаяСсылка()
	Возврат БизнесПроцессы.Исполнение.ПустаяСсылка(); 
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если (Объект.БизнесПроцесс <> ПустаяСсылка() И Объект.Наименование = "Проверка") = Истина Тогда 
		Ответ = Вопрос( "Задача выполнена успешно?", РежимДиалогаВопрос.ДаНет,0);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.Результат = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
