&НаКлиенте
Процедура ВидОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение = ЯвляетсяДоговором() Тогда
		Элементы.Контрагент.АвтоОтметкаНезаполненного = Истина;
		Элементы.КонтактноеЛицо.АвтоОтметкаНезаполненного = Истина;
		Объект.ЭтоДоговор = Истина;
	Иначе
		Элементы.Контрагент.АвтоОтметкаНезаполненного = Ложь;
		Элементы.КонтактноеЛицо.АвтоОтметкаНезаполненного = Ложь;
		Объект.ЭтоДоговор = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЯвляетсяДоговором()
	Возврат Справочники.ВидыДокументов.Договор;
КонецФункции

&НаСервере
Процедура ПриОткрытииНаСервере()
	Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	Роль = Справочники.Пользователи.НайтиПоНаименованию(Пользователь).Роль;
	Если Не Роль = "СогласованиеДокументов" Или Не Роль = "РуководительПодразделенияДокументы" Тогда
		Элементы.Согласован.ТолькоПросмотр = Истина;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры




