&НаКлиенте
Процедура ВидОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ЭтоДоговор = ПроверкаЯвляетсяДоговором(ВыбранноеЗначение);	
	Если ЭтоДоговор = Истина Тогда
		Элементы.Контрагент.АвтоОтметкаНезаполненного = Истина;
		Элементы.КонтактноеЛицо.АвтоОтметкаНезаполненного = Истина;
		Объект.ЭтоДоговор = Истина;
	Иначе
		Элементы.Контрагент.АвтоОтметкаНезаполненного = Ложь;
		Элементы.КонтактноеЛицо.АвтоОтметкаНезаполненного = Ложь;
		Объект.ЭтоДоговор = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроверкаЯвляетсяДоговором(ВыбранноеЗначение)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыДокументов.Ссылка КАК Ссылка,
		|	ВидыДокументов.ЭтоДоговор КАК ЭтоДоговор
		|ИЗ
		|	Справочник.ВидыДокументов КАК ВидыДокументов
		|ГДЕ
		|	ВидыДокументов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ВыбранноеЗначение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	КонецЦикла;
	
	Возврат ВыборкаДетальныеЗаписи.ЭтоДоговор;

КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РазрешеноМенятьСогласование = РольДоступна("СогласованиеДокументов")
	Или ПараметрыСеанса.ТекущийПользователь = Объект.Подразделение.Родитель;
	Элементы.Согласован.ТолькоПросмотр = Не РазрешеноМенятьСогласование;	
	
КонецПроцедуры





