&НаКлиенте
Процедура ВидОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение = ЯвляетсяДоговором() Тогда
		Элементы.Контрагент.АвтоОтметкаНезаполненного = Истина;
		Элементы.КонтактноеЛицо.АвтоОтметкаНезаполненного = Истина;
		Объект.ЭтоДоговор = Истина;
	Иначе
		Элементы.Контрагент.АвтоОтметкаНезаполненного = Ложь;
		Элементы.КонтактноеЛицо.АвтоОтметкаНезаполненного = Ложь;
		Объект.ЭтоДоговор = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЯвляетсяДоговором()
	Возврат Справочники.ВидыДокументов.Договор;
КонецФункции

