Процедура ПолнотекстовыйПоиск() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Файлы.ИмяФайла КАК ИмяФайла,
		|	Файлы.Содержание КАК Содержание,
		|	Файлы.ПутьДоФайла КАК ПутьДоФайла,
		|	Файлы.Код КАК Код,
		|	Файлы.Изменён КАК Изменён
		|ИЗ
		|	Справочник.Файлы КАК Файлы
		|ГДЕ
		|	Файлы.Изменён = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если Прав(ВыборкаДетальныеЗаписи.ИмяФайла,3) = "txt" Тогда
			Путь =  ВыборкаДетальныеЗаписи.ПутьДоФайла;
			ФайлТекс = Новый ЧтениеТекста(Путь, КодировкаТекста.UTF8);
			ФайлСсылка = Справочники.Файлы.НайтиПоКоду(ВыборкаДетальныеЗаписи.Код);
			ФайлОбъект = ФайлСсылка.ПолучитьОбъект();
			ФайлОбъект.Содержание = ФайлТекс.Прочитать();
			ФайлОбъект.Изменён = Ложь;
			ФайлОбъект.Записать();
			ФайлТекс.Закрыть();		
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры