
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("Выполнена", ПоказыватьТолькоНевыполненные);
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьОтбор(Команда)
	ПоказыватьТолькоНевыполненные = Не ПоказыватьТолькоНевыполненные;
	Список.Параметры.УстановитьЗначениеПараметра("Выполнена", ПоказыватьТолькоНевыполненные);
	Элементы.Список.Обновить();
	УправлениеФормой();
КонецПроцедуры

&НаСервере
Процедура ПереключитьОтборНаСервере()
	ПоказыватьТолькоНевыполненные = Не ПоказыватьТолькоНевыполненные;
	Список.Параметры.УстановитьЗначениеПараметра("Выполнена", ПоказыватьТолькоНевыполненные);
	Элементы.Список.Обновить();
	УправлениеФормойНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормой()	
	Элементы.ФормаПереключитьОтбор.Заголовок = ?(ПоказыватьТолькоНевыполненные,"Показать все", "Показать невыполненные");
КонецПроцедуры


&НаСервере
Процедура УправлениеФормойНаСервере()	
	Элементы.ФормаПереключитьОтбор.Заголовок = ?(ПоказыватьТолькоНевыполненные,"Показать все", "Показать невыполненные");	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеФормой();
КонецПроцедуры


&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	Если Не Настройки.Получить("ПоказыватьТолькоНевыполненные") = Неопределено Тогда
		ПоказыватьТолькоНевыполненные = Настройки.Получить("ПоказыватьТолькоНевыполненные");
	КонецЕсли;
	ПоказыватьТолькоНевыполненные = Не ПоказыватьТолькоНевыполненные;
	ПереключитьОтборНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗадачиОтМеня(Команда)
	ОткрытьФорму("Задача.ЗадачаПользователя.Форма.ЗадачиОтМеня");
КонецПроцедуры




