Процедура ЗадачаВыполненаУспешноПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Если ЭтотОбъект.ВедущаяЗадача.Результат Тогда
		Результат = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ВыполнитьПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
КонецПроцедуры

Процедура ВыполнитьПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	ФормируемыеЗадачи[0].Пользователь = ЭтотОбъект.Исполнитель;
	ФормируемыеЗадачи[0].АвторЗадачи = ЭтотОбъект.Автор;
КонецПроцедуры

Процедура ВыполнитьПередВыполнением(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	ЭтотОбъект.ВедущаяЗадача =  Задача;
	ЭтотОбъект.Записать();
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Автор = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры


	

