
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("Выполнена", ПоказыватьТолькоНевыполненные);
	УправлениеФормойНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьОтбор(Команда)
	ПоказыватьТолькоНевыполненные = Не ПоказыватьТолькоНевыполненные;
	Список.Параметры.УстановитьЗначениеПараметра("Выполнена", ПоказыватьТолькоНевыполненные);
	Элементы.Список.Обновить();
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормой()	
	Элементы.ФормаПереключитьОтбор.Заголовок = ?(ПоказыватьТолькоНевыполненные,"Показать все", "Показать невыполненные");
КонецПроцедуры


&НаСервере
Процедура УправлениеФормойНаСервере()	
	Элементы.ФормаПереключитьОтбор.Заголовок = ?(ПоказыватьТолькоНевыполненные,"Показать все", "Показать невыполненные");	
КонецПроцедуры


//&НаКлиенте
//Процедура ПриОткрытии(Отказ)
//	УправлениеФормой();
//КонецПроцедуры



